# Importing Data and Data overview

In [92]:
import pandas as pd #Library for data processing
import numpy as np #Library for mathematical operations
from matplotlib import pyplot as plt #Library for data visualization
import seaborn as sns
%matplotlib inline 

#'%'means modulo i.e. a modulo b

%config InlineBackend.figure_format = 'retina'
import warnings #import warnings library
warnings.filterwarnings('ignore') #ignore warning
import os

print(os.listdir("../Desktop/Data/Titanic/")) #print out what is included in the directory

['test.csv', 'titanic.zip', 'train.csv', 'gender_submission.csv']

In [93]:
train = pd.read_csv("~/Desktop/Data/Titanic/train.csv") #load the dataset
test = pd.read_csv("../Desktop/Data/Titanic/test.csv")

In [94]:
print("The shape of this dataset is (row, column):"+ str(train.shape)) #print dimension of the dataset
print(train.info()) #prints information of the data
print("The shape of the data set is (row, column):"+ str(test.shape))
print(test.info())

The shape of this dataset is (row, column):(891, 12)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None
The shape of the data set is (row, column):(418, 11)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
None

In [95]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [96]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

### The data is split into two groups: Training set and test set
#### The training set includes our dependent variable, passenger survival status along with other independent features like gender, class, fare and Pclass
#### The test should be used to see how our model performs on unseen data. When you say unseen data, we mean that the algorithmn or ML models have no relation to test data. We do not want to use any part of the test data in any way to modify our algorithms ; Which are the reasons why we clean our test data and train data separately (The test set does not provide passenger's survival status). We are going to use our model to predict passenger survival status.

### Categorical:
#### Nominal: Cabin, Embarked (Embarked location: C(Cherbourg),Q(Queenstown), S(Southhampton))
#### Dichotomous: Gender
#### Ordinal: Pclass(1(Upper), 2(Middle), 3(Lower))

### Numerical:
#### Discrete: PassengerID, SibSp, Parch, Survived(0 or 1)
#### Continuous: Age, Fare

### Text Variable: Ticket, Name

# Cleaning up data

In [98]:
passengerid = test.PassengerId #Keeping Passenger ID for later

In [99]:
#train.drop(['PassengerId'], axis=1, inplace=True) #Get rid of the 'PassengerId' column since it is useless
#test.drop(['PassengerId'], axis=1, inplace=True) 

print(train.info())
print("*"*60) #Print "*" 60 stars
print(test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None
************************************************************
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
None

#### Note that the features have unequal amount of data entries for every column and they have different types of variables.

## Dealing with missing values

In [113]:
train.isnull() #Find entries with null/missing values
train.isnull().sum() #count all the missing values

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [127]:
train.isnull().sum().sort_values(ascending=False) #sort the number of missing values from decreasing order

Cabin          687
Age            177
Embarked         2
Fare             0
Ticket           0
Parch            0
SibSp            0
Sex              0
Name             0
Pclass           0
Survived         0
PassengerId      0
dtype: int64

#### It seems that 'cabin', 'age' and 'embarked' have missing values in decreasing order!

In [135]:
total = train.isnull().sum().sort_values(ascending=False)
percent = round(total/len(train)*100, 2) #Round the percent to 2 decimal places
pd.concat([total, percent], axis=1, keys=['Total', 'Percent']) #concatenate two columns into one

             Total  Percent
Cabin          687    77.10
Age            177    19.87
Embarked         2     0.22
Fare             0     0.00
Ticket           0     0.00
Parch            0     0.00
SibSp            0     0.00
Sex              0     0.00
Name             0     0.00
Pclass           0     0.00
Survived         0     0.00
PassengerId      0     0.00

In [140]:
total = test.isnull().sum().sort_values(ascending=False)
percent = round(total/len(test)*100, 2)
pd.concat([total, percent], axis=1, keys=['Total', 'Percent'])

             Total  Percent
Cabin          327    78.23
Age             86    20.57
Fare             1     0.24
Embarked         0     0.00
Ticket           0     0.00
Parch            0     0.00
SibSp            0     0.00
Sex              0     0.00
Name             0     0.00
Pclass           0     0.00
PassengerId      0     0.00

#### We see that both datasets have missing values!

In [144]:
percent = pd.DataFrame(round(train.Embarked.value_counts(dropna=False, normalize=True)*100, 2))
total = pd.DataFrame(train.Embarked.value_counts(dropna=False))

total.columns = ['Total']
percent.columns = ['Percent']
pd.concat([total, percent], axis=1)

     Total  Percent
S      644    72.28
C      168    18.86
Q       77     8.64
NaN      2     0.22